# SpotDimensionType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpotDimension..::..SpotDimensionType Property
SpotDimension Class See Also
---
The dimension style of this dimension.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SpotDimensionType SpotDimensionType { get; set; }
```

Visual Basic
---
```text
Public Property SpotDimensionType As SpotDimensionType
	Get
	Set
```

Visual C++
---
```text
public:
property SpotDimensionType^ SpotDimensionType {
	SpotDimensionType^ get ();
	void set (SpotDimensionType^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
SpotDimension Class
Autodesk.Revit.DB Namespace